export interface Song {
  name: string;
  num: number;
  text?: {
    type: "Куплет" | "Припев";
    words: string[];
    notes: string[][];
  }[];
  bridge?: string[];
}

export interface Songer {
  songer: string;
  number: number;
  songs: Song[];
  image?: string;
}

export const songers: Songer[] = [
  {
    songer: "Агата Кристи",
    number: 1,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Ария",
    number: 2,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Алена Швец",
    number: 3,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Баста",
    number: 4,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Би",
    number: 5,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Бумбокс",
    number: 6,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Валентин Стрыкало",
    number: 7,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Гражданская оборона",
    number: 8,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "ДДТ",
    number: 9,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Жуки",
    number: 10,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Звери",
    number: 11,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Земфира",
    number: 12,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Кино",
    number: 13,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Король и шут",
    number: 14,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Любэ",
    number: 15,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Макс Корж",
    number: 16,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Наутилус Помпилиус",
    number: 17,
    image:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7FfriqBkLaMktbWqLTyIDr8EL4PW6nHorOw&s",

    songs: [
      {
        name: "Крылья",
        num: 1,
        text: [
          {
            type: "Куплет",
            words: [
              "Ты снимаешь вечернее платье,",
              "Стоя лицом к стене",
              "И я вижу свежие шрамы",
              "На гладкой, как бархат, спине.",
              "Мне хочется плакать от боли",
              "Или забыться во сне",
              "Где твои крылья, которые",
              "Так нравились мне?",
            ],
            notes: [["Am"], ["E"], ["Dm"], ["E"], ["Am"], ["E"], ["Dm"], ["E"]],
            // notes: [["Am"], ["E"], ["Dm"], ["E"], ["Am"], ["E"], ["Dm"], ["E"]],
          },
          {
            type: "Припев",
            words: [
              "Где твои крылья, которые нравились мне?",
              "Где твои крылья, которые нравились мне?",
            ],
            notes: [
              ["A#", "Am", "A#", "Am"],
              ["G", "Am", "G", "Am"],
            ],
          },
        ],
      },
      {
        name: "Одинокая птица",
        num: 2,
        text: [
          {
            type: "Куплет",
            words: [
              "Одинокая птица, ты летишь высоко",
              " В антрацитовом небе безлунных ночей",
              "Повергая в смятенье бродяг и собак",
              "Красотой и размахом крылатых плечей",
            ],
            notes: [
              ["Am", "C", "D", "E", "Am"],
              ["C", "D", "E", "Am"],
              ["C", "D", "E", "Am"],
              ["C", "D", "E", "Am"],
            ],
          },
          {
            type: "Припев",
            words: [
              " Одинокая птица ты летаешь высоко",
              " И лишь безумец был способен так влюбиться",
              "За тобою вслед подняться,",
              "За тобою вслед подняться",
              "Чтобы вместе с тобой разбиться",
              "С тобою вместе",
              "С тобою вместе",
              "С тобою вместе",
              "С тобою вместе",
            ],
            notes: [
              ["F", "G", "C", "Am"],
              ["F", "G", "E", "Am"],
              ["F", "G"],
              ["C", "Am"],
              ["F", "E", "Am"],
              ["Am", "C", "D"],
              ["Am", "C", "D"],
              ["Am", "C", "D"],
              ["Am", "C", "D"],
            ],
          },
        ],
      },
    ],
  },

  {
    songer: "Нервы",
    number: 18,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Сектор газа",
    number: 19,
    songs: [
      {
        name: "",
        num: 0,
      },
    ],
  },
  {
    songer: "Сплин",
    image:
      "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT7FfriqBkLaMktbWqLTyIDr8EL4PW6nHorOw&s",
    number: 20,
    songs: [
      {
        name: "Бог устал нас любить",
        num: 1,
        text: [
          {
            type: "Куплет",
            words: [
              "Мы чересчур увеличили дозу,",
              "Вспомнили все что хотели забыть,",
              "Или на рельсы легли слишком поздно.",
            ],
            notes: [
              ["Am", "D", "G"],
              ["Am", "D", "G"],
              ["Am", "D", "G"],
            ],
          },
          {
            type: "Припев",
            words: [
              "Бог устал нас любить,",
              "Бог устал нас любить.",
              "Бог просто устал нас любить,",
              "Бог просто устал...",
            ],
            notes: [["Am"], ["D", "G"], ["Am"], ["D", "G"]],
          },
          {
            type: "Куплет",
            words: [
              "Вот она, гильза от пули навылет,",
              "Карта которую нечем покрыть.",
              "Мы остаемся одни в этом мире.",
            ],
            notes: [
              ["Am", "D", "G"],
              ["Am", "D", "G"],
              ["Am", "D", "G"],
            ],
          },
          {
            type: "Припев",
            words: [
              "Бог устал нас любить,",
              "Бог устал нас любить.",
              "Бог просто устал нас любить,",
              "Бог просто устал...",
            ],
            notes: [["Am"], ["D", "G"], ["Am"], ["D", "G"]],
          },
          {
            type: "Куплет",
            words: [
              "Я рассказал бы тебе все что знаю,",
              "Только об этом нельзя говорить.",
              "Выпавший снег никогда не растает.",
            ],
            notes: [
              ["Am", "D", "G"],
              ["Am", "D", "G"],
              ["Am", "D", "G"],
            ],
          },
          {
            type: "Припев",
            words: [
              "Бог устал нас любить,",
              "Бог устал нас любить.",
              "Бог просто устал нас любить,",
              "Бог просто устал...",
            ],
            notes: [["Am"], ["D", "G"], ["Am"], ["D", "G"]],
          },
        ],
      },
      {
        name: "Бони и Клайд ",
        num: 2,
      },
      {
        name: "Весь этот бред",
        num: 3,
      },
      {
        name: "Выхода нет",
        num: 4,
      },
      {
        name: "Гни свою линию",
        num: 5,
      },
      {
        name: "Двое не спят",
        num: 6,
      },
      {
        name: "Дочь самурая ",
        num: 7,
      },
      {
        name: "Маяк ",
        num: 8,
      },
      {
        name: "Мое сердце",
        num: 9,
      },
      {
        name: "Новые люди ",
        num: 10,
      },
      {
        name: "Орбит без сахара ",
        num: 11,
      },
      {
        name: "Оркестр ",
        num: 12,
      },
      {
        name: "Остаемся зимовать ",
        num: 13,
      },
      {
        name: "Рай в шалаше",
        num: 14,
      },
      {
        name: "Романс ",
        num: 15,
      },
      {
        name: "Танцуй ",
        num: 16,
      },
      {
        name: "Чудак",
        num: 17,
      },
    ],
  },
];
